package com.example.moham.quote;

import java.util.ArrayList;
import java.util.List;

public class QuoteGenerator {
    private static List<Quote> quotes;
    public static List<Quote> generate() {
        quotes = new ArrayList<>();

        quotes.add(new Quote(
                "حب السلامة يثني عزم صاحبه ... عن المعالي ويغري المرء بالكسلِ ",
                "الطغرائي"));
        quotes.add(new Quote(
                "عجبت لمن لم يطلب العلم كيف تدعوه نفسه إلى مكرمة.",
                "عبد الله بن المبارك"));
        quotes.add(new Quote(
                "لم أكن الصديق الوحيد لأي شخص، لم أكن حلمًا لشخص يحبني، لم أشعر أنني الخيار الأول والأوحد في حياة أحد ولو لمرة، كنت دائمًا شخصًا عابرًا في حياة الجميع.",
                "أحمد خالد توفيق"));
        quotes.add(new Quote(
                "اترك فضول الكلام توفق للحكمة.", "عبد الله بن المبارك"));
        quotes.add(new Quote(
                "اكتبوا أحسن ما تسمعون واقرأوا أحسن ما تكتبون واحفظوا أحسن ما تقرأون وتحدثوا بأحسنِ ما تحفظون. ",
                "ابن المقفع"));
        quotes.add(new Quote
                ("إن أغنى الغنى العقل، وأكبر الفقر الحمق، وأوحش الوحشة العجب، وأكرم الكرم حسن الخلق.",
                "علي بن أبي طالب"));
        quotes.add(new Quote
                ("إذا نزل بك مكروه فانظر فان كان لك حيلة فلا تعجز، وإن لم يكن فيه حيلة فلا تجزع .",
                        "علي بن أبي طالب"));
        quotes.add(new Quote
                ("الوهم نصف الداء، والاطمئنان نصف الدواء، والصبر أول خطوات الشفاء.",
                        "ابن سينا"));
        quotes.add(new Quote("احذروا البطنة، فإن أكثر العلل إنما تتولد من فضول الطعام. ",
                "ابن سينا"));
        quotes.add(new Quote(
                "إن التفكير أصعب الأعمال، وهذا هو السبب في أن قليلين من يختارونه كعمل.",
                "هنري فورد"));

        return quotes;
    }
}
